<template>
  <div class="mask" v-show="showstate">
    <div class="maskContent-wrap flex-center">
        <div class="maskContent">
        <div class="change-title">
          <p>隐私协议</p>
          <span @click="close">×</span>
        </div>
        <div class="content">
          <h3>引言</h3>
          <p class="inner">
            亚卓教育（“我们”）非常重视用户的隐私和个人信息保护。您在使用我们的产品与/或服务时，我们可能会收集和使用您的相关信息。我们希望通过《亚卓教育隐私政策》（“本隐私政策”）
            向您说明我们在您使用我们的产品与/或服务时如何收集、使用、保存、共享和转让这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。
            本政策将帮助您了解以下内容：
          </p>

          <p>1、我们如何收集和使用您的个人信息</p>
          <p>2、通知和修订</p>
          <p>3、如何联系我们</p>

          <p class="inner">
            本隐私政策与您所使用的亚卓教育中小学数字教学中心服务以及该服务所包括的各种业务功能（以下统称“我们的产品与/或服务”）息息相关，
            希望您在使用我们的产品与/或服务前仔细阅读并确认您已经充分理解本政策所写明的内容，并让您可以按照本隐私政策的指引做出您认为适当的选择。
            本隐私政策中涉及的相关术语，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您更好地理解。您使用或在我们更新本隐私政策后（我们会及时提示您更新的情况）继续使用我们的产品与/或服务，
            即意味着您同意本隐私政策(含更新版本)内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。
          </p>

          <p>如对本隐私政策或相关事宜有任何问题，您可随时通过发送邮件至tomcat@yazhuo365.com或拨打我们的客服电话等多种方式与我们联系 。</p>

          <h3>目录</h3>

          <div class="mu">一、我们如何收集和使用您的个人信息</div>
          <div class="mu">二、通知和修订</div>
          <div class="mu">三、如何联系我们</div>

          <div class="mu-title">一、我们如何收集和使用您的个人信息</div>

          <p class="mu-txt">
            我们的产品与/或服务包括一些核心功能，这些功能包含了实现微信第三方授权登录所必须的功能、改进我们的产品与/或服务所必须的功能及保障产品与/或服务正常使用所必须的功能。
            <span>
              我们可能会收集、保存和使用下列与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法享受我们提供的产品与/或服务。这些功能包括：
            </span>
          </p>

          <div class="mu-title-sec">1、实现用户登录后正常所必须的功能</div>

          <p>（1）第三方（微信）授权获取共享信息</p>

          <p class="mb20">① 第三方（微信）授权登录</p>

          <p class="mu-txt">
            我们可能从第三方获取您授权共享的账户信息，当您准备实现账户登录时，我们会以第三方（微信）向您发出授权登录。
            <span>
              您需要确认是否确认登录并同意我们使用您的微信账号信息（昵称、头像、地区及性别）等相关信息，我们将通过微信授权的方式来登录您的账号。
            </span>
          </p>

          <p class="mb20">② 第三方（微信）授权绑定</p>

          <p class="mu-txt">
            您首先需要授权微信绑定已有账号，并同意勾选本隐私政策后将您的第三方账户与您的亚卓教育中小学数字教学中心账户绑定。
            <span>当您绑定时，您需要至少向我们提供您准备使用账户的名称、密码，我们将验证您的身份是否有效。</span>
            您可以修改补充您的名称、性别、生日以及您的实名验证相关信息，这些信息均属于您的“个人信息”。您补充的个人信息将有助于我们为您提供更优的用户体验，但如果您不提供这些补充信息，不会影响您使用基本功能。
          </p>

          <p>您可以通过第三方账户直接登录并使用我们的产品与/或服务。我们会将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。</p>

          <p class="mb20">（2）客服与售后功能</p>

          <p>我们的电话客服和售后功能会使用您的账号信息和个人信息。</p>

          <p class="mb20">为保证您的账号安全，我们的呼叫中心客服和在线客服会使用您的账号信息与您核验您的身份。当您需要我们提供与您账号信息相关的客服与售后服务时，我们将会查询您的个人信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如我们的产品最后使用时间。</p>

          <p class="mu-title-sec">2、改进我们的产品与/或服务所必须的功能</p>

          <p class="mu-txt">
            <span>我们可能会收集您的浏览信息、您的登录环境信息进行数据分析，用来将您感兴趣的商品或服务信息展示给您；或在您搜索时向您展示您可能希望找到的商品。</span>
            我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与我们的关联方、我们合作伙伴之间互动时我们获得的相关信息。对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。我们可能会将来自某项服务的信息与来自其他服务的信息结合起来，以便为您提供服务、个性化内容和建议。
          </p>

          <p class="mu-title-sec">3、保障交易安全所必须的功能</p>

          <p>为提高您使用我们的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，我们可能会通过了解您的浏览信息、您常用的软件信息、设备信息等手段来判断您的账号风险，并可能会记录一些我们认为有风险的链接（“URL”）；我们也会收集您的设备信息对于系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。</p>

          <p class="mu-title">（二）您充分知晓，以下情形中，我们收集、使用个人信息无需征得您的授权同意：</p>

          <p class="inner">1、与国家安全、国防安全有关的；</p>
          <p class="inner">2、与公共安全、公共卫生、重大公共利益有关的；</p>
          <p class="inner">3、与犯罪侦查、起诉、审判和判决执行等有关的；</p>
          <p class="inner">4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
          <p class="inner">5、所收集的个人信息是个人信息主体自行向社会公众公开的；</p>
          <p class="inner">6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</p>
          <p class="inner">7、根据您的要求签订合同所必需的；</p>
          <p class="inner">8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；</p>
          <p class="inner">9、为合法的新闻报道所必需的；</p>
          <p class="inner">10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</p>
          <p class="inner">11、法律法规规定的其他情形。</p>

          <p class="mu-title">（三）您个人信息使用的规则</p>

          <p>1、我们会根据本隐私政策的约定并为实现我们的产品与/或服务功能对所收集的个人信息进行使用。</p>

          <p class="mu-txt">
            2、在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别主体。
            <span>请您了解并同意，在此情况下我们有权使用已经去标识化的信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。</span>
          </p>

          <p class="mu-txt">
            3、<span>请您注意，您在使用我们的产品与/或服务时所提供的所有个人信息，除非您拒绝我们收集，否则将在您使用我们的产品与/或服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除您的个人信息。</span>
          </p>

          <p>4、我们会对我们的产品与/或服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示我们的产品与/或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。</p>

          <p>5、当我们展示您的个人信息时，我们会采用包括内容替换、匿名处理方式对您的信息进行脱敏，以保护您的信息安全。</p>

          <p>6、当我们要将您的个人信息用于本政策未载明的其它用途时，或基于特定目的收集而来的信息用于其他目的时，会通过您主动做出勾选的形式事先征求您的同意。</p>

          <p class="mu-title">二、通知和修订</p>

          <p class="mb20">1、为给您提供更好的服务以及随着亚卓教育业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在亚卓教育中小学数字教学中心及移动端上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问时及时了解最新的隐私政策。</p>

          <p class="mb20">2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。</p>

          <p>本政策所指的重大变更包括但不限于：</p>
          <p>（1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
          <p>（2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
          <p>（3）您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
          <p>（4）个人信息安全影响评估报告表明存在高风险时。</p>

          <p class="mu-title">三、如何联系我们</p>

          <p>1、如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请通过发送邮件至tomcat@yazhuo365.com或拨打我们的客服电话等多种方式与我们联系。</p>

          <p>2、一般情况下，我们将在三十天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以向网信、电信、公安及工商等监管部门进行投诉或举报。</p>

          <p class="inner">如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即通过本政策的联系方式联络我们，以便我们采取相应措施。</p>
          
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'agreement',
    data () {
      return {

      }
    },
    props: ['showstate'],
    mounted(){
    },
    methods: {
      close () {
        this.$emit('tocancel')
      }
    }
  }
</script>

<style style="less" scoped>
  .mask {
  display: block;
  position: fixed;
  left: 0;
  top: 0;
  right: 0;
  bottom: 0;
  background: rgba(0, 0, 0, .5);
  z-index: 999;
  }
  .maskContent-wrap{
    width: 100%;
    height: 100%;
    min-width: 100vw;
    min-height: 100vh;
  }
  .maskContent {
  width: 893px;
  /* height: 495px; */
  height: 600px;
  background-color: #fff;
  /* margin: 100px auto; */
  border-radius: 5px;
  }
  .change-title {
  width: 100%;
  height: 40px;
  display: flex;
  align-items: center;
  justify-content: space-between;
  padding: 0 20px;
  box-sizing: border-box;
  font-size: 14px;
  background-color: #F5F6FA;
  border-radius: 5px;
  color: #666;
  }
  .change-title span {
  cursor: pointer;
  font-size: 24px;
  color: #666;
  }
  h3 {
      font-size: 18px;
      font-weight: bold;
      display: flex;
      justify-content: center;
      padding: 10px 0;
      box-sizing: border-box;
  }
  .content{
    padding: 10px;
    box-sizing: border-box;
    height: 560px;
    overflow-y: scroll;
  }
  .inner{
    font-weight: bold;
  }
  .mu{
    color: #0084FF;
    margin-bottom: 10px;
    font-size: 16px;
  }
  .mu-title, .mu-title-sec{
    color: #666;
    font-size: 18px;
    font-weight: bold;
    padding: 20px 0 10px;
  }
  .mu-title-sec{
    color: #333;
  }
  .mu-txt span{
    font-weight: bold;
  }
  .mb20{
    margin: 20px 0;
  }
  
  /*  */
</style>